{
  "backend/main.mo": "Defines passage data, session tracking, and exposes queries to fetch passages by language and record typing sessions.",
  "feature_evidence.json": "Lists feature implementations with associated frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all major frontend files covering typing, history, services, and UI components.",
  "frontend/index.css": "Configures Tailwind layers and CSS variables for light/dark themes with OKLCH color tokens.",
  "frontend/index.html": "Basic HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App layout defining header, TypingPractice view, and footer with branding and external link.",
  "frontend/src/features/history/HistoryPanel.tsx": "Renders recent typing test history with language, duration, WPM, accuracy, and timestamps.",
  "frontend/src/features/history/historyStore.ts": "Manages localStorage-backed test history with add, get, and clear operations.",
  "frontend/src/features/history/useHistory.ts": "React Query wrapper for reading/updating history with optimistic updates.",
  "frontend/src/features/typing/components/DurationSelector.tsx": "Duration picker providing selectable test times using toggle buttons.",
  "frontend/src/features/typing/components/PassageDisplay.tsx": "Renders the passage with per-character correctness and current-position highlighting using Unicode-aware segmentation.",
  "frontend/src/features/typing/components/ResultsSummary.tsx": "Displays final typing stats with performance badges and metrics like WPM, accuracy, and errors.",
  "frontend/src/features/typing/components/StatsBar.tsx": "Shows a live status bar with time remaining, WPM, accuracy, and error count.",
  "frontend/src/features/typing/TypingPractice.tsx": "Main typing workflow handling language, passage loading, typing engine, results, and backend session recording.",
  "frontend/src/features/typing/unicode.ts": "Provides Unicode-safe text segmentation and comparison utilities for accurate typing evaluation.",
  "frontend/src/features/typing/usePassage.ts": "Fetches a random passage for a given language using React Query and exposes loading and refetch controls.",
  "frontend/src/features/typing/useTypingEngine.ts": "Implements the core typing test logic including timing, input handling, state transitions, and stat calculation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handlers, and identity loading on mount.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing, as query logic is handled in feature-specific hooks.",
  "frontend/src/index.css": "Defines Tailwind layers and theme variables including color tokens and character-state utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/services/passages.ts": "Fetches passages by language from the backend actor with lazy actor initialization.",
  "frontend/src/services/sessions.ts": "Records typing sessions to the backend using a lazily-created actor.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH color system, typography and animation extensions, and includes several Tailwind plugins.",
  "project_state.json": "Defines the project’s state, existing features, new feature requests, and image requirements for a bilingual typing‑practice web app."
}